{
    "works": {
        "work1": {
            "slug": "slug1",
            "title": "Archlight üçün adaptiv dizayn sistemi qurmaq",
            "description": "Bu layihədə Archlight üçün çevik və genişlənə bilən bir dizayn sistemi yaratdım. Ön tərəf inkişafı üçün Next.js və dizayn əməkdaşlığı üçün Figma istifadə edərək əsas məqsəd təkrar istifadə oluna bilən, gələcək tələblərə asanlıqla uyğunlaşa bilən komponent kitabxanası yaratmaq idi. Əsas Xüsusiyyətlər:1. **Komponent Kitabxanası**: React və Next.js-də styled-components istifadə edərək modulyar, təkrar istifadə oluna bilən UI komponentləri hazırladım. Diqqət əlçatanlıq, cavablılıq və vizual uyğunluq üzərində idi.2. **Temalaşdırma və Fərdiləşdirmə**: CSS dəyişənləri və Figma tokenlərindən istifadə edərək rəng palitralarını, tipoqrafiyanı və dizayn üslublarını asanlıqla dəyişdirmək üçün dinamik temalaşdırma sistemi inteqrasiya edildi.3. **Figma İnteqrasiyası**: Dizaynerlər və inkişafçılar arasında əməkdaşlığı asanlaşdırmaq üçün Figma ilə sinxronlaşdırılmış dizayn kitabxanası yaratdım. Bu, dizayn tokenlərinin uyğunluğunu təmin etdi və təhvil prosesini sadələşdirdi.4. **Sənədləşdirmə**: Storybook vasitəsilə komponentləri, istifadə qaydalarını və ən yaxşı təcrübələri nümayiş etdirən hərtərəfli sənədlər hazırladım.**İstifadə Olunan Texnologiyalar:**- Next.js: Sürətli və serverdə render edilən React tətbiqləri üçün.- Figma: Dizayn resurslarının və prototiplərin idarə olunması üçün.- Styled-Components: Modulyar və temalaşdırıla bilən komponent tərtibatı üçün.- Storybook: İnteraktiv komponent sənədləşdirməsi üçün.**Çağırışlar və Öyrənilənlər:**Əsas çağırışlardan biri dizayn uyğunluğu ilə inkişafçılar üçün çevikliyi balanslaşdırmaq idi. Bunun üçün dəqiq dizayn tokenləri və fərdiləşdirmə qaydaları müəyyən edildi. Dizaynerlər və inkişafçılar arasında əməkdaşlığı Figma və Git vasitəsilə daha effektiv hala gətirmək də öyrənilən əsas təcrübələrdən biri oldu.**Nəticə:**Dizayn sistemi artıq bir neçə layihədə aktiv şəkildə istifadə olunur və bu, daha sürətli inkişaf dövrlərinə, daha yaxşı əməkdaşlığa və daha az uyğunsuzluqlara səbəb olur. Məhsullarımızı genişləndirmək üçün möhkəm bir təməl təmin edir və eyni zamanda vahid istifadəçi təcrübəsi yaradır.",
            "readmore": "Bu layihə haqqında ətraflı..."
        }
    }
}