{
    "works": {
        "work1": {
            "slug": "slug1",
            "title": "Building an Adaptive Design System for Archlight",
            "description": "In this project, I created a flexible and scalable design system tailored to Archlight's needs. Utilizing Next.js for front-end development and Figma for design collaboration, the primary goal was to develop a reusable component library that adhered to consistent design principles while remaining easily extendable for future requirements.  Key Features:1. **Component Library**: Designed modular, reusable UI components using React and styled-components in Next.js. The focus was on accessibility, responsiveness, and visual consistency.2. **Theming and Customization**: Implemented a dynamic theming system that allowed effortless switching of color palettes, typography, and layout styles using CSS variables and Figma tokens.3. **Figma Integration**: Established a synchronized design library in Figma to streamline collaboration between designers and developers, ensuring consistency in design tokens and reducing design handoff issues.4. **Documentation**: Created comprehensive documentation using Storybook to showcase components, usage patterns, and best practices, making the design system accessible for other teams.**Technologies Used:**- Next.js: For building fast, server-rendered React applications.- Figma: For managing design assets and prototypes.- Styled-Components: For themable and modular component styling.- Storybook: For interactive component documentation.**Challenges and Learnings:**One major challenge was balancing design consistency with the flexibility developers needed. This was addressed by defining clear design tokens and guidelines on customization. Establishing effective collaboration workflows between designers and developers using Figma and Git was another learning experience that enhanced the overall process.**Outcome:**The design system is actively used across multiple projects, resulting in faster development cycles, improved collaboration, and fewer inconsistencies. It provides a solid foundation for scaling our products while ensuring a seamless and cohesive user experience.",
            "readmore": "More about this project"
        }
    }
}